/*int n = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(n + 5);*/  //преобразование строки в число
// ctrl+/
// ctrl+k, ctrl+u



/*Напишите программу, которая на вход принимает
 число и выдает его квадрат (число умноженное 
 // на само себя).
// Например:
// 4 -> 16 
// -3 -> 9 
// -7 -> 49*/

Console.Clear();
Console.Write("введите число: ");
int n = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(n * n);




